avr-rust/avrd/packs/atmega/ATmega1284.atdf
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register A  Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register B  Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC3">
        <register caption="Timer/Counter3 Interrupt Mask Register" name="TIMSK3" offset="0x71" size="1">
          <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="ICIE3"/>
          <bitfield caption="Timer/Counter3 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE3B"/>
          <bitfield caption="Timer/Counter3 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE3A"/>
          <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x01" name="TOIE3"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR3" offset="0x38" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter3 Input Capture Flag" mask="0x20" name="ICF3"/>
          <bitfield caption="Timer/Counter3 Output Compare B Match Flag" mask="0x04" name="OCF3B"/>
          <bitfield caption="Timer/Counter3 Output Compare A Match Flag" mask="0x02" name="OCF3A"/>
          <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x01" name="TOV3"/>
        </register>
        <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
          <bitfield caption="Compare Output Mode 3A, bits" mask="0xC0" name="COM3A"/>
          <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
          <bitfield caption="Pulse Width Modulator Select Bits" mask="0x03" name="WGM3"/>
        </register>
        <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
          <bitfield caption="Input Capture 3 Noise Canceler" mask="0x80" name="ICNC3"/>
          <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
          <bitfield caption="Waveform Generation Mode Bits" mask="0x18" name="WGM3" lsb="2"/>
          <bitfield caption="Clock Select3 bits" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter3 Control Register C" name="TCCR3C" offset="0x92" size="1">
          <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC3A"/>
          <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC3B"/>
        </register>
        <register caption="Timer/Counter3  Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register A  Bytes" name="OCR3A" offset="0x98" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Output Compare Register B  Bytes" name="OCR3B" offset="0x9A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter3 Input Capture Register  Bytes" name="ICR3" offset="0x96" size="2" mask="0xFFFF"/>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
      <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
        <register caption="Timer/Counter Interrupt Mask register" name="TIMSK2" offset="0x70" size="1">
          <bitfield caption="Timer/Counter2 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE2B"/>
          <bitfield caption="Timer/Counter2 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE2A"/>
          <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR2" offset="0x37" size="1" ocd-rw="R">
          <bitfield caption="Output Compare Flag 2B" mask="0x04" name="OCF2B"/>
          <bitfield caption="Output Compare Flag 2A" mask="0x02" name="OCF2A"/>
          <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
        </register>
        <register caption="Timer/Counter2 Control Register A" name="TCCR2A" offset="0xB0" size="1">
          <bitfield caption="Compare Output Mode bits" mask="0xC0" name="COM2A"/>
          <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2B"/>
          <bitfield caption="Waveform Genration Mode" mask="0x03" name="WGM2"/>
        </register>
        <register caption="Timer/Counter2 Control Register B" name="TCCR2B" offset="0xB1" size="1">
          <bitfield caption="Force Output Compare A" mask="0x80" name="FOC2A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC2B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM22"/>
          <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
        </register>
        <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF"/>
        <register caption="Timer/Counter2 Output Compare Register B" name="OCR2B" offset="0xB4" size="1" mask="0xFF"/>
